Revit 2027 API
AXMImportOptions(AXMImportOptions) Constructor
 Constructs a new instance of AXMImportOptions as a copy of the provided import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AXMImportOptions(
	AXMImportOptions option
)
Public Sub New (
	option As AXMImportOptions
)
public:
AXMImportOptions(
	AXMImportOptions^ option
)
new :
        option : AXMImportOptions -> AXMImportOptions
Parameters
option AXMImportOptions
 The AXM import options to be copied.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AXMImportOptions Class
AXMImportOptions Overload
Autodesk.Revit.DB Namespace